// array.includes() =====>>>>>>
// array.find() =====>>>>>>
// array.forEach() =====>>>>>>
// array.filter() =====>>>>>>
// array.map() =====>>>>>>
// array.slice() =====>>>>>>
// array.concat() =====>>>>>>

// array.reverse() =====>>>>>>
// array.sort() =====>>>>>>
// array.push(9) =====>>>>>> () এর মধ্যের প্যারামিটার শেষে ইনসার্ট করে দেয়
// array.pop() =====>>>>>> শেষ আইটেম ডিলিট করে দেয়
// array.shift() =====>>>>>> প্রথম আইটেম ডিলিট করে দেয়
// array.unshift(9) =====>>>>>> () এর মধ্যের প্যারামিটার প্রথমে ইনসার্ট করে দেয়
// array.includes(9) =====>>>>>> () এর মধ্যের ভ্যালু এরে তে থাকলে true দেয়, না থাকলে false দেয়
// var, let, const =====>>>>>> var রিডিক্লিয়ার এবং রিএসাইন করা যায়। আরো পড়তে হবে
// let, var, const =====>>>>>> let রিডিক্লিয়ার করা যায় না কিন্তু রিএসাইন করা যায়। আরো পড়তে হবে
// const, var, let =====>>>>>> const রিডিক্লিয়ার এবং রিএসাইন করা যায় না। তবে টাইপ যেমন এবং এর ভিতরের ভ্যালু চেঞ্জ করা যায়। আরো পড়তে হবে
// copy array =====>>>>>> newArray = [...array] Spread Operator এর মাধ্যমে এরে কপি করলে কপি এবং অরিজিনাল যে কোন এরে তে আলাদা ভাবে চেঞ্জ করা যায়। ডাইরেক্ট কপি করলে এক এরে তে চেঞ্জ করলে অন্য এরে তেও চেঞ্জ হয়ে  যায়।
// Spread Operator =====>>>>>> newArray = [...array] Spread Operator এর মাধ্যমে copy array এরে কপি করলে কপি এবং অরিজিনাল যে কোন এরে তে আলাদা ভাবে চেঞ্জ করা যায়। ডাইরেক্ট কপি করলে এক এরে তে চেঞ্জ করলে অন্য এরে তেও চেঞ্জ হয়ে  যায়।